Revit 2027 API
BuiltInFailures.ImportFailures.IFCGenericImportWarning Property
 The following problems were encountered in the IFC file: [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IFCGenericImportWarning { get; }
Public Shared ReadOnly Property IFCGenericImportWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IFCGenericImportWarning {
	FailureDefinitionId^ get ();
}
static member IFCGenericImportWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace